# Accessing elements in DataFrames #

In [207]:
import pandas as pd

#items = [{'bikes':100, 'pants':25, 'watches':35}, {'bikes':1000, 'cars':10000}]

items = [{'bikes':100}]
         
# will just specify a number for each row label
df_stores = pd.DataFrame(items)
df_stores

   bikes
0    100

In [185]:
# will just specify each row label
df_stores = pd.DataFrame(items, index=['store 1', 'store 2'])
df_stores

         bikes  pants  watches     cars
store 1    100   25.0     35.0      NaN
store 2   1000    NaN      NaN  10000.0

### To get a column of values from the matrix ###

items is a list of lists. So items[[ ]] is referring to the columns list.

In [186]:
df_stores[['bikes']]

         bikes
store 1    100
store 2   1000

In [187]:
df_stores[['bikes', 'pants']]

         bikes  pants
store 1    100   25.0
store 2   1000    NaN

In [188]:
print(df_stores[['bikes']])

         bikes
store 1    100
store 2   1000

You can get a value from the matrix using item[col][row]

In [189]:
df_stores['bikes']['store 2']

1000

### To add a column to a DataFrame ###

In [190]:
df_stores['shirts']= [10, 25]
df_stores

         bikes  pants  watches     cars  shirts
store 1    100   25.0     35.0      NaN      10
store 2   1000    NaN      NaN  10000.0      25

In [191]:
df_stores['suits'] = df_stores['pants'] + df_stores['shirts']
df_stores

         bikes  pants  watches     cars  shirts  suits
store 1    100   25.0     35.0      NaN      10   35.0
store 2   1000    NaN      NaN  10000.0      25    NaN

If you want a new row:

In [192]:
# create a list of 1 dictionary 
new_items = [{'bikes':2, 'watches':10, 'cars':2000}]

# create a DataFrame from that list, and give it an index
new_store = pd.DataFrame(new_items, index=['store 3'])

new_store

         bikes  watches  cars
store 3      2       10  2000

In [193]:
# now append the DataFrame to the df_stores DataFram
df_stores = pd.concat([df_stores, new_store])
df_stores

         bikes  pants  watches     cars  shirts  suits
store 1    100   25.0     35.0      NaN    10.0   35.0
store 2   1000    NaN      NaN  10000.0    25.0    NaN
store 3      2    NaN     10.0   2000.0     NaN    NaN

## To add a column ##

In [194]:
df_stores['new watches']= df_stores['watches'][0:]
df_stores

         bikes  pants  watches     cars  shirts  suits  new watches
store 1    100   25.0     35.0      NaN    10.0   35.0         35.0
store 2   1000    NaN      NaN  10000.0    25.0    NaN          NaN
store 3      2    NaN     10.0   2000.0     NaN    NaN         10.0

## To insert a column ##

use insert(loc, column, values)

In [195]:
df_stores.insert(3, 'shoes', [50, 200, 25])
df_stores

         bikes  pants  watches  shoes     cars  shirts  suits  new watches
store 1    100   25.0     35.0     50      NaN    10.0   35.0         35.0
store 2   1000    NaN      NaN    200  10000.0    25.0    NaN          NaN
store 3      2    NaN     10.0     25   2000.0     NaN    NaN         10.0

In [196]:
df_stores.pop('new watches')
df_stores

         bikes  pants  watches  shoes     cars  shirts  suits
store 1    100   25.0     35.0     50      NaN    10.0   35.0
store 2   1000    NaN      NaN    200  10000.0    25.0    NaN
store 3      2    NaN     10.0     25   2000.0     NaN    NaN

In [197]:
df_stores = df_stores.drop(['suits', 'shirts'], axis=1)
df_stores

         bikes  pants  watches  shoes     cars
store 1    100   25.0     35.0     50      NaN
store 2   1000    NaN      NaN    200  10000.0
store 3      2    NaN     10.0     25   2000.0

In [198]:
df_stores = df_stores.drop(['store 1', 'store 2'], axis=0)
df_stores

         bikes  pants  watches  shoes    cars
store 3      2    NaN     10.0     25  2000.0

In [201]:
df_stores = df_stores.rename(columns={'bikes':'hats'})
df_stores

         hats  pants  watches  shoes    cars
store 3     2    NaN     10.0     25  2000.0

In [203]:
df_stores = df_stores.rename(index={'store 3':'My store'})
df_stores

          hats  pants  watches  shoes    cars
My store     2    NaN     10.0     25  2000.0

In [205]:
df_stores = df_stores.set_index('pants')
df_stores

       hats  watches  shoes    cars
pants
NaN       2     10.0     25  2000.0